// 1)  git init - создает папку гит и инициализирует
// 2)  git add . - собирает все папки из родительского директория
// 3)  git commit -m "" - пишем что мы сделали
// 4)  git remote add origin ссылка на репозиторий в гитхабе
// 5)  git push origin main - чтобы залить наш проект на гитхаб
// 6)  git branch - посмотреть в какой ветке мы находимся
// 7)  git branch -a - эта команда для того чтобы посмотреть список все веток
// 8)  git branch -b - эта командя для того чтобы создать ветку
// 9)  git checkout  назвние ветки - переключает ветки
// 10) git pull origin main/master - чтобы стянуть измение из главной ветки
// 11) git log - можем посмотреть историю комитов
// 12) git reset --hard HEAD~1 - эта команда для отката пулл реквест


// команды чтобы обратно залить на гитхаб родительсую директорию
// 1) git add .
// 2) git commit -m "qwerty"
// 3) git push origin main